# FluidTemperature Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FluidTemperature Properties
FluidTemperature Class See Also
---
The FluidTemperature type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Density | The density value |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Temperature | The temperature value |
| Viscosity | The dynamic viscosity value |

# See Also
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace